In [1]:
import pandas as pd
import numpy as np

In [2]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

In [3]:
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [4]:


df1 = make_df('AB', [1, 2])

In [5]:
df2 = make_df('AB', [2, 3])

In [6]:
df1

    A   B
1  A1  B1
2  A2  B2

In [7]:
df2

    A   B
2  A2  B2
3  A3  B3

In [8]:
pd.concat([df1,df2],axis=1)

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2   A2   B2
3  NaN  NaN   A3   B3

In [9]:
pd.concat([df1,df2])

    A   B
1  A1  B1
2  A2  B2
2  A2  B2
3  A3  B3

In [10]:
pd.concat([df1,df2],ignore_index=True)

    A   B
0  A1  B1
1  A2  B2
2  A2  B2
3  A3  B3

In [11]:
#### Concatenation and Joins

In [12]:
df5=make_df('ABC',[1,2])
df6=make_df('BCD',[3,4])

In [13]:
df5

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

In [18]:
df6
df6.index=df5.index

In [19]:
pd.concat([df5,df6])

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
1  NaN  B3  C3   D3
2  NaN  B4  C4   D4

In [20]:
#inner join

In [24]:
pd.concat([df5,df6],join='inner',ignore_index=False)

    B   C
1  B1  C1
2  B2  C2
1  B3  C3
2  B4  C4

In [25]:
pd.concat([df5,df6],join='inner',ignore_index=True)

    B   C
0  B1  C1
1  B2  C2
2  B3  C3
3  B4  C4

In [26]:
pd.concat([df5,df6],join='outer',ignore_index=False)

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
1  NaN  B3  C3   D3
2  NaN  B4  C4   D4

In [27]:
df5.append(df6)

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
1  NaN  B3  C3   D3
2  NaN  B4  C4   D4

In [28]:
#one to one joins

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [29]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [30]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [31]:
pd.merge(df1,df2)
# default inner join

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [34]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [36]:
df3 = pd.merge(df1,df2)

In [37]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [38]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

In [39]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [41]:
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [42]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [43]:
pd.merge(df1,df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [44]:
### More to Merge Cases.

In [45]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

In [46]:
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [47]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [51]:
pd.merge(df1,df3,left_on="employee",right_on="name")

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [54]:
pd.merge(df1,df3,left_on="employee",right_on="name").drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [69]:
df1.set_index('employee',inplace=True)

KeyError: 'employee'

In [70]:
df2.set_index('employee',inplace=True)

KeyError: 'employee'

In [71]:
df1

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [72]:
pd.merge(df1,df2,left_index='employee',right_index='employee')

ValueError: left_index parameter must be of type bool, not <class 'str'>

In [73]:
df2

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [76]:
pd.merge(df1,df2,left_index=True,right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [80]:
df1.reset_index(inplace=True)

In [81]:
df2.reset_index(inplace=True)

In [82]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [95]:
df2

Empty DataFrame
Columns: []
Index: [Lisa, Bob, Jake, Sue]

In [85]:
df1.set_index('group',inplace=True)

In [91]:
df2.set_index('employee',inplace=True)

In [92]:
pd.merge(df1,df2)

MergeError: No common columns to perform merge on

In [93]:
df1

            employee
group
Accounting       Bob
Engineering     Jake
Engineering     Lisa
HR               Sue

In [94]:
df2

Empty DataFrame
Columns: []
Index: [Lisa, Bob, Jake, Sue]

In [90]:
pd.merge(df1,df2,left_index=True,right_index=True)

TypeError: '<' not supported between instances of 'str' and 'int'

In [96]:
df1.reset_index()

         group employee
0   Accounting      Bob
1  Engineering     Jake
2  Engineering     Lisa
3           HR      Sue

In [97]:
df2.reset_index()

  employee
0     Lisa
1      Bob
2     Jake
3      Sue

In [98]:
df2

Empty DataFrame
Columns: []
Index: [Lisa, Bob, Jake, Sue]

In [99]:
df1

            employee
group
Accounting       Bob
Engineering     Jake
Engineering     Lisa
HR               Sue

In [100]:
df2

Empty DataFrame
Columns: []
Index: [Lisa, Bob, Jake, Sue]

In [101]:
df2.reset_index()

  employee
0     Lisa
1      Bob
2     Jake
3      Sue

In [102]:
df1.reset_index()

         group employee
0   Accounting      Bob
1  Engineering     Jake
2  Engineering     Lisa
3           HR      Sue

In [103]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

In [104]:
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [105]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [106]:
pd.merge(df6,df7)

   name   food drink
0  Mary  bread  wine

In [107]:
pd.merge(df6,df7,how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [108]:
pd.merge(df6,df7,how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [109]:
pd.merge(df6,df7,how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer